---
kind: other
id: Properties.T:Autodesk.Revit.DB.AssemblyType
source: html/ea514685-4ba8-e6fc-6675-5d36f2f0e777.htm
---
# AssemblyType Properties

The id of the assembly instance to which the element belongs.